package com.javarush.test.level01.lesson06.task01

fun main(args: Array<String>) {
    println("Меня зовут Амиго.")
    println("")
    println("Я согласен на зарплату $800/месяц в первый год.")
    println("Я согласен на зарплату $1500/месяц во второй год.")
    println("Я согласен на зарплату $2200/месяц в третий год.")
    println("Я согласен на зарплату $2700/месяц в четвертый год.")
    println("Я согласен на зарплату $3200/месяц в пятый год.")
    println("")
    println("Поцелуй мой блестящий металлический зад!")
}